In [2]:
!pip install pandas

Requirement already satisfied: pandas in ./myenv/lib/python3.13/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in ./myenv/lib/python3.13/site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in ./myenv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./myenv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./myenv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in ./myenv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: pip install --upgrade pip

In [30]:
!pip freeze > requirements.txt

In [7]:
# ! pip install -r requirements.txt

In [8]:
# import pandas

import pandas as pd

In [12]:
# Series

srs = pd.Series(["Ram", "Shyam", "Gopal"], name="Names")
print(srs)

0      Ram
1    Shyam
2    Gopal
Name: Names, dtype: object

In [13]:
temp = pd.Series([10, 13, 24, 25], name="Temperature")
print("Temperature\n", temp)

Temperature
 0    10
1    13
2    24
3    25
Name: Temperature, dtype: int64

In [17]:
# DataFrame

data = {
    "Name": ["Ram", "Shyam", "Gopal", "Sita"],
    "Age": [20, 22, 23, 21],
    "Department": ["Civil", "BCE", "BEE", "BCE"]
}

students = pd.DataFrame(data)
students

    Name  Age Department
0    Ram   20      Civil
1  Shyam   22        BCE
2  Gopal   23        BEE
3   Sita   21        BCE

In [19]:
filtered_data = students[students["Age"] > 21]
filtered_data

    Name  Age Department
1  Shyam   22        BCE
2  Gopal   23        BEE

In [ ]:
# save students to csv

students.to_csv("student_data.csv", index=False)

In [ ]:
# save students to excel
# Need openpyxl module
# !pip install openpyxl

students.to_excel("student_data.xlsx", index=False)

In [31]:
# Read csv

df = pd.read_csv("student_data.csv")
df

    Name  Age Department
0    Ram   20      Civil
1  Shyam   22        BCE
2  Gopal   23        BEE
3   Sita   21        BCE

In [33]:
df.head(2)

    Name  Age Department
0    Ram   20      Civil
1  Shyam   22        BCE

In [35]:
df.tail(2)

    Name  Age Department
2  Gopal   23        BEE
3   Sita   21        BCE

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        4 non-null      object
 1   Age         4 non-null      int64
 2   Department  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [37]:
df.describe()

             Age
count   4.000000
mean   21.500000
std     1.290994
min    20.000000
25%    20.750000
50%    21.500000
75%    22.250000
max    23.000000

In [ ]:
# Read excel

df1 = pd.read_excel("student_data.xlsx")
df1

    Name  Age Department
0    Ram   20      Civil
1  Shyam   22        BCE
2  Gopal   23        BEE
3   Sita   21        BCE